artillery.yml
config:
  target: http://localhost:8000
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
          - get:
              url: "/pokemon"
          - get:
              url: "/capturedPokemon"
          - get:
              url: "/pokemon/0/capture"
          - get:
              url: "/pokemon/1/capture"
          - get:
              url: "/capturedPokemon"
          - get:
              url: "/capturedPokemon/0/evolve"
          - delete:
              url: "/capturedPokemon/0"
          - delete:
              url: "/capturedPokemon/1"
        count: 100